var font = "啊阿埃挨哎唉哀皑癌蔼矮艾碍爱隘鞍氨安俺按暗岸胺案肮昂盎凹敖熬翱袄傲奥懊澳芭捌扒叭吧笆八疤巴拔跋靶把耙坝霸罢爸白柏百摆佰败拜稗斑班搬扳般颁板版扮拌伴瓣半办绊邦帮梆榜膀绑棒磅蚌镑傍谤苞胞包褒剥薄雹保堡饱宝抱报暴豹鲍爆杯碑悲卑北辈背贝钡倍狈备惫焙被奔苯本笨崩绷甭泵蹦迸逼鼻比鄙笔彼碧蓖蔽毕毙毖币庇痹闭敝弊必辟壁臂避陛鞭边编贬扁便变卞辨辩辫遍标彪膘表鳖憋别瘪彬斌濒滨宾摈兵冰柄丙秉饼炳病并玻菠播拨钵波博勃搏铂箔伯帛舶脖膊渤泊驳捕卜哺补埠不布步簿部怖擦猜裁材才财睬踩采彩菜蔡餐参蚕残惭惨灿苍舱仓沧藏操糙槽曹草厕策侧册测层蹭插叉茬茶查碴搽察岔差诧拆柴豺搀掺蝉馋谗缠铲产阐颤昌猖场尝常长偿肠厂敞畅唱倡超抄钞朝嘲潮巢吵炒车扯撤掣彻澈郴臣辰尘晨忱沉陈趁衬撑称城橙成呈乘程惩澄诚承逞骋秤吃痴持匙池迟弛驰耻齿侈尺赤翅斥炽充冲虫崇宠抽酬畴踌稠愁筹仇绸瞅丑臭初出橱厨躇锄雏滁除楚础储矗搐触处揣川穿椽传船喘串疮窗幢床闯创吹炊捶锤垂春椿醇唇淳纯蠢戳绰疵茨磁雌辞慈瓷词此刺赐次聪葱囱匆从丛凑粗醋簇促蹿篡窜摧崔催脆瘁粹淬翠村存寸磋撮搓措挫错搭达答瘩打大呆歹傣戴带殆代贷袋待逮怠耽担丹单郸掸胆旦氮但惮淡诞弹蛋当挡党荡档刀捣蹈倒岛祷导到稻悼道盗德得的蹬灯登等瞪凳邓堤低滴迪敌笛狄涤翟嫡抵底地蒂第帝弟递缔颠掂滇碘点典靛垫电佃甸店惦奠淀殿碉叼雕凋刁掉吊钓调跌爹碟蝶迭谍叠丁盯叮钉顶鼎锭定订丢东冬董懂动栋侗恫冻洞兜抖斗陡豆逗痘都督毒犊独读堵睹赌杜镀肚度渡妒端短锻段断缎堆兑队对墩吨蹲敦顿囤钝盾遁掇哆多夺垛躲朵跺舵剁惰堕蛾峨鹅俄额讹娥恶厄扼遏鄂饿恩而儿耳尔饵洱二贰发罚筏伐乏阀法珐藩帆番翻樊矾钒繁凡烦反返范贩犯饭泛坊芳方肪房防妨仿访纺放菲非啡飞肥匪诽吠肺废沸费芬酚吩氛分纷坟焚汾粉奋份忿愤粪丰封枫蜂峰锋风疯烽逢冯缝讽奉凤佛否夫敷肤孵扶拂辐幅氟符伏俘服浮涪福袱弗甫抚辅俯釜斧脯腑府腐赴副覆赋复傅付阜父腹负富讣附妇缚咐噶嘎该改概钙盖溉干甘杆柑竿肝赶感秆敢赣冈刚钢缸肛纲岗港杠篙皋高膏羔糕搞镐稿告哥歌搁戈鸽胳疙割革葛格蛤阁隔铬个各给根跟耕更庚羹埂耿梗工攻功恭龚供躬公宫弓巩汞拱贡共钩勾沟苟狗垢构购够辜菇咕箍估沽孤姑鼓古蛊骨谷股故顾固雇刮瓜剐寡挂褂乖拐怪棺关官冠观管馆罐惯灌贯光广逛瑰规圭硅归龟闺轨鬼诡癸桂柜跪贵刽辊滚棍锅郭国果裹过哈骸孩海氦亥害骇酣憨邯韩含涵寒函喊罕翰撼捍旱憾悍焊汗汉夯杭航壕嚎豪毫郝好耗号浩呵喝荷菏核禾和何合盒貉阂河涸赫褐鹤贺嘿黑痕很狠恨哼亨横衡恒轰哄烘虹鸿洪宏弘红喉侯猴吼厚候后呼乎忽瑚壶葫胡蝴狐糊湖弧虎唬护互沪户花哗华猾滑画划化话槐徊怀淮坏欢环桓还缓换患唤痪豢焕涣宦幻荒慌黄磺蝗簧皇凰惶煌晃幌恍谎灰挥辉徽恢蛔回毁悔慧卉惠晦贿秽会烩汇讳诲绘荤昏婚魂浑混豁活伙火获或惑霍货祸击圾基机畸稽积箕肌饥迹激讥鸡姬绩缉吉极棘辑籍集及急疾汲即嫉级挤几脊己蓟技冀季伎祭剂悸济寄寂计记既忌际继纪嘉枷夹佳家加荚颊贾甲钾假稼价架驾嫁歼监坚尖笺间煎兼肩艰奸缄茧检柬碱硷拣捡简俭剪减荐槛鉴践贱见键箭件健舰剑饯渐溅涧建僵姜将浆江疆蒋桨奖讲匠酱降蕉椒礁焦胶交郊浇骄娇嚼搅铰矫侥脚狡角饺缴绞剿教酵轿较叫窖揭接皆秸街阶截劫节茎睛晶鲸京惊精粳经井警景颈静境敬镜径痉靖竟竞净炯窘揪究纠玖韭久灸九酒厩救旧臼舅咎就疚鞠拘狙疽居驹菊局咀矩举沮聚拒据巨具距踞锯俱句惧炬剧捐鹃娟倦眷卷绢撅攫抉掘倔爵桔杰捷睫竭洁结解姐戒藉芥界借介疥诫届巾筋斤金今津襟紧锦仅谨进靳晋禁近烬浸尽劲荆兢觉决诀绝均菌钧军君峻俊竣浚郡骏喀咖卡咯开揩楷凯慨刊堪勘坎砍看康慷糠扛抗亢炕考拷烤靠坷苛柯棵磕颗科壳咳可渴克刻客课肯啃垦恳坑吭空恐孔控抠口扣寇枯哭窟苦酷库裤夸垮挎跨胯块筷侩快宽款匡筐狂框矿眶旷况亏盔岿窥葵奎魁傀馈愧溃坤昆捆困括扩廓阔垃拉喇蜡腊辣啦莱来赖蓝婪栏拦篮阑兰澜谰揽览懒缆烂滥琅榔狼廊郎朗浪捞劳牢老佬姥酪烙涝勒乐雷镭蕾磊累儡垒擂肋类泪棱楞冷厘梨犁黎篱狸离漓理李里鲤礼莉荔吏栗丽厉励砾历利傈例俐痢立粒沥隶力璃哩俩联莲连镰廉怜涟帘敛脸链恋炼练粮凉梁粱良两辆量晾亮谅撩聊僚疗燎寥辽潦了撂镣廖料列裂烈劣猎琳林磷霖临邻鳞淋凛赁吝拎玲菱零龄铃伶羚凌灵陵岭领另令溜琉榴硫馏留刘瘤流柳六龙聋咙笼窿隆垄拢陇楼娄搂篓漏陋芦卢颅庐炉掳卤虏鲁麓碌露路赂鹿潞禄录陆戮驴吕铝侣旅履屡缕虑氯律率滤绿峦挛孪滦卵乱掠略抡轮伦仑沦纶论萝螺罗逻锣箩骡裸落洛骆络妈麻玛码蚂马骂嘛吗埋买麦卖迈脉瞒馒蛮满蔓曼慢漫谩芒茫盲氓忙莽猫茅锚毛矛铆卯茂冒帽貌贸么玫枚梅酶霉煤没眉媒镁每美昧寐妹媚门闷们萌蒙檬盟锰猛梦孟眯醚靡糜迷谜弥米秘觅泌蜜密幂棉眠绵冕免勉娩缅面苗描瞄藐秒渺庙妙蔑灭民抿皿敏悯闽明螟鸣铭名命谬摸摹蘑模膜磨摩魔抹末莫墨默沫漠寞陌谋牟某拇牡亩姆母墓暮幕募慕木目睦牧穆拿哪呐钠那娜纳氖乃奶耐奈南男难囊挠脑恼闹淖呢馁内嫩能妮霓倪泥尼拟你匿腻逆溺蔫拈年碾撵捻念娘酿鸟尿捏聂孽啮镊镍涅您柠狞凝宁拧泞牛扭钮纽脓浓农弄奴努怒女暖虐疟挪懦糯诺哦欧鸥殴藕呕偶沤啪趴爬帕怕琶拍排牌徘湃派攀潘盘磐盼畔判叛乓庞旁耪胖抛咆刨炮袍跑泡呸胚培裴赔陪配佩沛喷盆砰抨烹澎彭蓬棚硼篷膨朋鹏捧碰坯砒霹批披劈琵毗啤脾疲皮匹痞僻屁譬篇偏片骗飘漂瓢票撇瞥拼频贫品聘乒坪苹萍平凭瓶评屏坡泼颇婆破魄迫粕剖扑铺仆莆葡菩蒲埔朴圃普浦谱曝瀑期欺栖戚妻七凄漆柒沏其棋奇歧畦崎脐齐旗祈祁骑起岂乞企启契砌器气迄弃汽泣讫掐洽牵扦钎铅千迁签仟谦乾黔钱钳前潜遣浅谴堑嵌欠歉枪呛腔羌墙蔷强抢橇锹敲悄桥瞧乔侨巧鞘撬翘峭俏窍切茄且怯窃钦侵亲秦琴勤芹擒禽寝沁青轻氢倾卿清擎晴氰情顷请庆琼穷秋丘邱球求囚酋泅趋区蛆曲躯屈驱渠取娶龋趣去圈颧权醛泉全痊拳犬券劝缺炔瘸却鹊榷确雀裙群然燃冉染瓤壤攘嚷让饶扰绕惹热壬仁人忍韧任认刃妊纫扔仍日戎茸蓉荣融熔溶容绒冗揉柔肉茹蠕儒孺如辱乳汝入褥软阮蕊瑞锐闰润若弱撒洒萨腮鳃塞赛三叁伞散桑嗓丧搔骚扫嫂瑟色涩森僧莎砂杀刹沙纱傻啥煞筛晒珊苫杉山删煽衫闪陕擅赡膳善汕扇缮墒伤商赏晌上尚裳梢捎稍烧芍勺韶少哨邵绍奢赊蛇舌舍赦摄射慑涉社设砷申呻伸身深娠绅神沈审婶甚肾慎渗声生甥牲升绳省盛剩胜圣师失狮施湿诗尸虱十石拾时什食蚀实识史矢使屎驶始式示士世柿事拭誓逝势是嗜噬适仕侍释饰氏市恃室视试收手首守寿授售受瘦兽蔬枢梳殊抒输叔舒淑疏书赎孰熟薯暑曙署蜀黍鼠属术述树束戍竖墅庶数漱恕刷耍摔衰甩帅栓拴霜双爽谁水睡税吮瞬顺舜说硕朔烁斯撕嘶思私司丝死肆寺嗣四伺似饲巳松耸怂颂送宋讼诵搜艘擞嗽苏酥俗素速粟僳塑溯宿诉肃酸蒜算虽隋随绥髓碎岁穗遂隧祟孙损笋蓑梭唆缩琐索锁所塌他它她塔獭挞蹋踏胎苔抬台泰酞太态汰坍摊贪瘫滩坛檀痰潭谭谈坦毯袒碳探叹炭汤塘搪堂棠膛唐糖倘躺淌趟烫掏涛滔绦萄桃逃淘陶讨套特藤腾疼誊梯剔踢锑提题蹄啼体替嚏惕涕剃屉天添填田甜恬舔腆挑条迢眺跳贴铁帖厅听烃汀廷停亭庭挺艇通桐酮瞳同铜彤童桶捅筒统痛偷投头透凸秃突图徒途涂屠土吐兔湍团推颓腿蜕褪退吞屯臀拖托脱鸵陀驮驼椭妥拓唾挖哇蛙洼娃瓦袜歪外豌弯湾玩顽丸烷完碗挽晚皖惋宛婉万腕汪王亡枉网往旺望忘妄威巍微危韦违桅围唯惟为潍维苇萎委伟伪尾纬未蔚味畏胃喂魏位渭谓尉慰卫瘟温蚊文闻纹吻稳紊问嗡翁瓮挝蜗涡窝我斡卧握沃巫呜钨乌污诬屋无芜梧吾吴毋武五捂午舞伍侮坞戊雾晤物勿务悟误昔熙析西硒矽晰嘻吸锡牺稀息希悉膝夕惜熄烯溪汐犀檄袭席习媳喜铣洗系隙戏细瞎虾匣霞辖暇峡侠狭下厦夏吓掀锨先仙鲜纤咸贤衔舷闲涎弦嫌显险现献县腺馅羡宪陷限线相厢镶香箱襄湘乡翔祥详想响享项巷橡像向象萧硝霄削哮嚣销消宵淆晓小孝校肖啸笑效楔些歇蝎鞋协挟携邪斜胁谐写械卸蟹懈泄泻谢屑薪芯锌欣辛新忻心信衅星腥猩惺兴刑型形邢行醒幸杏性姓兄凶胸匈汹雄熊休修羞朽嗅锈秀袖绣墟戌需虚嘘须徐许蓄酗叙旭序畜恤絮婿绪续轩喧宣悬旋玄选癣眩绚靴薛学穴雪血勋熏循旬询寻驯巡殉汛训讯逊迅压押鸦鸭呀丫芽牙蚜崖衙涯雅哑亚讶焉咽阉烟淹盐严研蜒岩延言颜阎炎沿奄掩眼衍演艳堰燕厌砚雁唁彦焰宴谚验殃央鸯秧杨扬佯疡羊洋阳氧仰痒养样漾邀腰妖瑶摇尧遥窑谣姚咬舀药要耀椰噎耶爷野冶也页掖业叶曳腋夜液一壹医揖铱依伊衣颐夷遗移仪胰疑沂宜姨彝椅蚁倚已乙矣以艺抑易邑屹亿役臆逸肄疫亦裔意毅忆义益溢诣议谊译异翼翌绎茵荫因殷音阴姻吟银淫寅饮尹引隐印英樱婴鹰应缨莹萤营荧蝇迎赢盈影颖硬映哟拥佣臃痈庸雍踊蛹咏泳涌永恿勇用幽优悠忧尤由邮铀犹油游酉有友右佑釉诱又幼迂淤于盂榆虞愚舆余俞逾鱼愉渝渔隅予娱雨与屿禹宇语羽玉域芋郁吁遇喻峪御愈欲狱育誉浴寓裕预豫驭鸳渊冤元垣袁原援辕园员圆猿源缘远苑愿怨院曰约越跃钥岳粤月悦阅耘云郧匀陨允运蕴酝晕韵孕匝砸杂栽哉灾宰载再在咱攒暂赞赃脏葬遭糟凿藻枣早澡蚤躁噪造皂灶燥责择则泽贼怎增憎曾赠扎喳渣札轧铡闸眨栅榨咋乍炸诈摘斋宅窄债寨瞻毡詹粘沾盏斩辗崭展蘸栈占战站湛绽樟章彰漳张掌涨杖丈帐账仗胀瘴障招昭找沼赵照罩兆肇召遮折哲蛰辙者锗蔗这浙珍斟真甄砧臻贞针侦枕疹诊震振镇阵蒸挣睁征狰争怔整拯正政帧症郑证芝枝支吱蜘知肢脂汁之织职直植殖执值侄址指止趾只旨纸志挚掷至致置帜峙制智秩稚质炙痔滞治窒中盅忠钟衷终种肿重仲众舟周州洲诌粥轴肘帚咒皱宙昼骤珠株蛛朱猪诸诛逐竹烛煮拄瞩嘱主著柱助蛀贮铸筑住注祝驻抓爪拽专砖转撰赚篆桩庄装妆撞壮状椎锥追赘坠缀谆准捉拙卓桌琢茁酌啄着灼浊兹咨资姿滋淄孜紫仔籽滓子自渍字鬃棕踪宗综总纵邹走奏揍租足卒族祖诅阻组钻纂嘴醉最罪尊遵昨左佐柞做作坐座峥叨恰蜓筝蜻橘匕丐夭叽吆凫阱芙杈岖鸠沐妓姊卦拗茉昙肴衩玷茴荞荠盹咧昵咪秕胧奕飒炫祠荸莺桦唠蚣蚪蚓唧秫麸捺匾蚯蛉啰铐铛笙笤偎徙翎庵涮悴裆谒雳跛锉掰牍腌猬愕鹉蒿榄楣嗦跷蜈嗤馍禀缤榛榕嘁嘀幔箫漩橄嘹蝠蝌蝙鲫憔翩嬉缭薇噩蟥霎踱蹂蟆螃鹦瘾缰檐檩瞭蟋蟀朦臊鳄鳍癞璧簸鬓躏吖嗄锕捱嗳嗌嫒瑷暧砹锿霭谙埯揞犴桉铵鹌黯坳嗷岙廒遨媪骜獒聱螯鏊鳌鏖茇菝岜灞钯粑鲅魃捭呗阪坂钣瘢癍舨蒡浜葆孢煲鸨褓趵龅孛陂邶埤萆蓓悖碚鹎褙鐾鞴畚坌贲锛嘣甏俾荜薜吡哔狴庳愎滗濞弼妣婢嬖畀铋裨筚箅篦舭襞跸髀弁苄忭汴缏飚煸砭碥窆褊笾鳊婊骠杓飑飙镖镳瘭裱鳔髟蹩傧豳玢槟殡膑镔髌邴摒亳啵饽檗擘礴钹鹁踣卟逋瓿晡钚钸醭嚓礤孱骖璨粲黪伧嘈漕螬艚恻岑涔噌猹馇汊姹楂槎檫锸镲侪钗瘥虿冁谄蒇廛忏潺澶羼婵骣觇禅镡蟾躔伥鬯苌菖徜怅惝阊娼嫦昶氅鲳怊晁耖坼砗谌谶抻嗔宸琛榇碜龀丞埕枨柽塍瞠铖裎蛏酲傺坻墀茌叱哧啻彳饬媸敕眵鸱瘛褫蚩螭笞篪豉踟魑茺忡憧铳舂艟俦帱惆瘳雠亍刍怵憷绌杵楮樗褚蜍蹰黜搋啜膪踹舛遄巛氚钏舡怆陲棰槌莼鹑蝽辍踔龊茈呲鹚糍苁淙骢琮璁枞楱辏腠蔟徂猝殂酢蹙蹴汆撺爨镩萃啐璀榱毳隹忖皴厝嵯脞矬痤鹾蹉耷哒嗒怛妲褡笪靼鞑埭甙呔岱迨骀绐玳黛儋萏啖殚赕眈疸瘅聃箪谠凼菪宕砀忉氘纛锝噔嶝戥磴镫簦氐籴诋谛邸荻娣绨柢棣觌砥碲睇镝羝骶嗲丶阽坫巅钿癜癫簟踮铞铫貂鲷垤堞揲喋牒瓞耋蹀鲽仃啶玎腚碇町疔耵酊铥垌咚岽峒氡胨胴硐鸫蔸窦篼芏嘟渎椟蠹笃髑黩椴煅簖怼憝碓镦沌炖砘礅趸咄哚沲缍柁铎裰谔垩苊莪萼呃屙婀轭腭锇锷鹗颚诶蒽摁佴迩珥铒鸸鲕垡砝蕃蘩幡梵燔畈蹯邡枋钫舫鲂芾狒悱淝妃绯榧腓斐扉镄痱蜚篚翡霏鲱偾瀵棼鲼鼢俸酆葑唪沣砜缶匐郛苻茯莩菔拊呋幞怫滏艴孚驸绂绋桴赙祓砩黻黼罘稃馥蚨蜉蝮趺跗鲋鳆尬尕尜旮钆陔垓戤赅坩苷尴擀泔淦澉绀旰矸疳酐戆罡筻睾诰郜藁缟槔槁杲锆鬲仡哿圪塥嗝搿膈硌镉袼虼舸骼亘茛哏艮哽赓绠鲠珙肱觥佝诟岣遘媾缑枸觏彀笱篝鞲嘏诂菰崮汩梏轱牯牿臌毂瞽罟钴锢鸪痼蛄酤觚鲴鹘诖呱栝胍鸹倌莞掼涫盥鹳矜鳏咣犷桄胱匦刿庋宄妫桧炅晷皈簋鲑鳜衮绲磙鲧馘埚掴呙帼崞猓椁虢聒蜾蝈铪嗨胲醢邗菡撖阚瀚晗焓顸颔蚶鼾沆绗颃薅嗥嚆濠灏昊皓颢蚝诃劾壑嗬阖纥曷盍颌蚵翮蘅珩桁黉訇讧荭蕻薨闳泓堠後逅瘊篌糇鲎骺冱唿囫岵猢怙惚浒滹琥槲轷觳烀煳戽扈祜瓠鹄鹕鹱笏醐斛骅砉铧踝郇奂萑擐圜獾洹浣漶寰逭缳锾鲩鬟隍徨湟潢遑璜肓癀篁鳇诙荟蕙咴哕喙隳洄浍彗缋晖恚虺蟪麾诨馄阍溷劐藿攉嚯夥钬锪镬耠蠖丌亟乩剞佶偈诘墼芨芰蒺蕺掎咭哜岌嵴洎屐骥畿玑楫殛戟戢赍觊犄齑矶羁嵇稷瘠虮笈笄暨跻跽霁鲚髻麂伽郏葭岬浃迦珈戛胛恝铗镓痂瘕袷蛱笳袈跏僭谏谫菅蒹搛湔蹇謇缣枧楗戋戬牮犍毽腱睑锏鹣裥笕翦趼踺鲣鞯茳洚绛犟礓耩糨豇佼僬艽茭挢噍峤徼姣敫皎鹪蛟醮跤鲛讦拮喈嗟婕孑桀碣疖颉蚧羯鲒骱卺荩堇噤馑廑妗缙瑾槿赆觐衿刭儆菁獍憬泾迳弪婧肼胫腈旌迥扃僦啾阄柩桕鹫赳鬏倨讵苣苴莒掬遽屦琚椐榘榉犋飓钜锔窭裾趄醵踽龃雎瞿鞫鄄狷涓桊蠲锩镌隽厥劂谲矍蕨噘噱崛獗孓珏桷橛爝镢蹶觖捃皲筠麇佧咔胩剀垲蒈忾恺铠锎锴侃莰戡龛瞰伉闶钪尻栲犒嗑岢恪溘骒缂珂轲氪瞌钶锞稞疴窠颏髁裉铿倥崆箜芤蔻叩眍筘刳堀喾绔骷侉蒯郐哙狯脍髋诓诳邝圹夼哐纩贶馗匮夔隗蒉揆喹喟悝愦逵暌睽聩蝰篑跬悃阃琨锟醌鲲髡蛞邋旯砬瘌崃徕涞濑赉睐铼籁岚漤斓罱镧褴莨蒗啷阆锒稂螂崂栳铑铹痨耢醪仂叻泐鳓羸诔嘞嫘缧檑耒酹塄愣俪俚郦坜苈莅蓠藜呖唳喱猁溧澧逦娌嫠骊缡枥栎轹戾砺詈罹锂鹂疠疬蛎蜊蠡笠篥粝醴跞鲡鳢黧蔹奁潋濂琏楝殓臁裢裣蠊鲢墚椋踉靓魉蓼尥獠寮钌鹩冽埒捩洌趔躐鬣蔺啉嶙廪懔遴辚膦瞵粼麟酃苓呤囹泠绫柃棂瓴聆鲮浏遛骝绺旒熘锍镏鹨鎏垅茏泷珑栊砻癃偻蒌喽嵝镂瘘耧蝼髅垆捋撸噜闾泸渌漉逯璐栌榈橹轳辂辘氇胪膂镥稆鸬鹭褛簏舻鲈脔娈栾鸾銮锊囵倮蠃荦摞猡泺漯珞椤脶镙瘰雒呒唛犸嬷杩劢荬霾墁缦熳镘颟螨鳗鞔邙漭硭蟒袤茆峁泖瑁昴牦耄旄懋瞀蟊髦麽莓嵋猸浼湄镅鹛袂魅扪焖懑钔勐甍瞢懵礞虻蜢蠓艋艨芈谧蘼嘧猕汨宓弭脒祢敉糸縻麋沔渑湎腼眄黾喵邈缈缪杪淼眇鹋咩蠛篾苠岷闵泯缗玟珉愍鳘冥茗溟暝瞑酩谟蓦嫫殁镆秣瘼耱貊貘侔哞眸蛑蝥鍪仫坶苜毪钼肭镎衲鼐艿萘柰喃囝囡楠腩蝻赧攮囔馕曩孬垴呶猱瑙硇铙蛲讷恁嗯伲坭猊怩旎慝睨铌鲵廿埝辇黏鲇鲶茑嬲脲袅乜陧蘖嗫颞臬蹑佞苎咛甯聍狃忸妞侬哝耨弩胬孥驽恧钕衄傩搦喏锘喔噢讴怄瓯耦葩杷筢俳蒎哌爿泮袢襻蟠蹒彷滂逄匏狍庖脬疱辔帔旆锫醅霈湓堋嘭怦蟛丕仳陴邳郫圮鼙芘擗噼庀淠媲纰枇甓睥罴铍癖疋蚍蜱貔谝骈犏胼蹁剽嘌嫖缥殍瞟螵丿苤氕拚姘嫔榀牝颦俜娉枰鲆叵鄱珀攴钋钷皤笸裒掊匍噗溥濮璞氆镤镨蹼亓俟圻芑芪萁萋葺蕲屺岐汔淇骐绮琪琦杞桤槭耆欹祺憩碛颀蛴蜞綦綮蹊麒葜髂倩佥阡芊芡茜荨掮岍悭慊骞搴褰缱椠肷愆钤虔箬箝戕嫱樯戗炝锖锵镪襁蜣羟跄劁诮谯愀樵硗鞒郄惬妾挈锲箧芩揿吣嗪噙溱檎锓覃螓衾苘圊檠磬罄箐謦鲭黥邛茕穹蛩筇跫銎俅巯犰湫逑遒楸赇虬蝤裘糗鳅鼽诎劬蕖蘧衢阒璩觑氍朐祛磲鸲癯蛐蠼麴黢诠荃悛绻辁畎铨蜷筌鬈阕阙悫逡苒蚺髯禳穰荛娆桡仞荏葚饪轫稔衽嵘狨肜蝾糅鞣蓐薷嚅洳溽濡缛铷襦颥朊芮蕤枘睿蚋偌卅仨挲脎噻馓毵糁搡磉颡埽缫缲瘙鳋啬铯穑唼歃铩痧裟鲨酾剡讪鄯埏芟潸姗嬗骟膻钐疝蟮舢跚鳝垧绱殇熵觞劭苕潲蛸筲艄厍佘猞滠歙畲麝诜谂莘哂渖椹胂矧蜃嵊晟眚谥埘莳蓍弑轼贳炻铈螫舐筮豕鲥鲺狩绶艏丨倏塾菽摅沭澍姝纾毹腧殳唰闩孀蒴搠妁槊铄厮兕厶咝汜泗澌姒驷缌祀锶鸶耜蛳笥凇菘崧嵩忪悚淞竦叟薮嗖嗾馊溲飕瞍锼螋夙谡蔌嗉愫涑簌觫稣狻谇荽濉邃燧眭睢荪狲飧榫隼唢嗍娑桫睃羧闼溻遢榻沓铊趿鳎邰薹肽炱钛跆鲐郯澹忐钽锬傥帑溏瑭樘铴镗耥螗螳羰醣鼗啕洮韬焘饕忒忑铽滕倜悌逖缇鹈裼醍掭忝阗殄畋佻祧窕蜩粜龆鲦髫萜餮莛葶婷梃铤霆佟仝茼嗵恸潼砼钭骰堍荼菟钍酴抟彖疃煺氽饨暾豚乇佗坨庹沱柝橐砣箨酡跎鼍佤娲腽剜芄菀纨绾琬脘畹蜿罔尢惘辋魍诿隈葳囗帏帷崴嵬猥闱沩洧涠逶娓玮韪軎炜煨痿艉鲔刎阌汶璺雯蓊蕹倭莴幄渥肟硪龌兀仵阢邬圬芴唔庑怃忤浯寤迕妩婺骛杌牾焐鹜痦鋈鼯僖兮隰郗菥葸蓰奚唏饩阋浠淅屣玺樨曦觋欷熹禊禧皙穸蜥螅舄舾羲粞翕醯鼷呷狎遐瑕柙硖罅黠冼苋莶藓岘猃暹娴氙燹祆鹇痫蚬筅籼酰跣跹霰芗葙饷庠骧缃蟓鲞飨哓崤潇逍骁绡枭枵筱魈偕亵勰燮薤撷獬廨渫瀣邂绁缬榭榍躞囟馨昕歆鑫陉荇荥擤饧悻硎芎咻岫馐庥溴鸺貅髹诩勖圩蓿洫溆顼栩煦盱胥糈醑儇谖萱揎泫渲璇楦暄煊碹铉镟痃谑泶踅鳕巽埙荀蕈薰峋徇獯恂洵浔曛醺鲟伢垭揠岈迓娅琊桠氩砑睚痖厣匚俨偃兖谳郾鄢菸崦恹闫阏湮滟妍嫣琰晏胭焱罨筵酽魇餍鼹徉怏泱炀烊恙蛘鞅爻崾徭幺珧杳轺曜鹞窈繇鳐靥揶晔烨铘刈劓佚佾诒圯埸懿苡荑薏弈挹弋呓咦咿噫峄嶷猗饴怿怡悒漪迤驿缢殪轶贻旖熠眙钇镒镱痍瘗癔翊蜴舣羿翳酏黟胤鄞垠堙茚吲喑狺夤洇氤铟窨霪龈嬴郢茔萦撄嘤膺滢潆瀛瑛璎楹媵瘿颍罂唷俑壅墉喁慵邕镛甬鳙饔卣攸侑莠莜莸呦囿宥柚猷牖铕疣蚰蚴蝣鱿黝鼬禺毓伛俣谀谕萸蓣揄圄圉嵛狳饫馀庾阈鬻妪妤纡瑜昱觎腴欤於煜燠聿钰鹆鹬瘀窳蜮蝓竽臾舁雩龉垸塬芫掾沅媛瑗橼爰眢鸢螈箢鼋龠瀹樾刖钺郓芸狁恽愠纭韫殒昀氲熨拶咂崽甾瓒昝簪糌趱錾奘驵臧唣仄赜啧帻迮昃笮箦舴谮缯甑罾锃揸吒咤哳砟痄蚱齄砦瘵谵搌旃仉鄣幛嶂獐嫜璋蟑诏棹钊笊谪摺柘辄磔鹧褶蜇赭圳蓁浈缜桢轸赈胗朕祯畛稹鸩箴诤徵钲铮卮陟郅埴芷摭帙忮彘咫骘栉枳栀桎轵轾贽胝膣祉祗黹雉鸷痣蛭絷酯跖踬踯豸觯冢锺螽舯踵荮啁妯纣绉胄碡籀酎伫侏邾茱洙渚潴杼槠橥炷铢疰瘃竺箸舳翥躅麈啭馔颛僮惴骓缒肫窀倬诼擢浞涿濯焯禚斫镯谘嵫孳缁梓辎赀恣眦锱秭耔笫粢趑觜訾龇鲻髭偬腙粽诹陬鄹驺鲰俎菹镞攥缵躜蕞撙樽鳟阼唑嘬怍胙祚";


 
//alert(font.length)
var tu3flag = false;
var sss = ""
function toimg(m){
	var logo =   "assets/data/" + encodeURIComponent(m).replace(new RegExp(/(%)/g),"").toLowerCase() + ".jpg";
	return logo;
}
function find_char(ch){
	if(font.indexOf(ch)>-1){
		if(tu3flag){
			return  "<img width='135px' style='margin:0px;margin:0;padding:0;' src='"+toimg(ch)+"' />";
		} else {
			return  "<img class='igm' width='140px' src='"+toimg(ch)+"' /> ";
		}		
	} else {
		if(tu3flag){
			return  '<div style="font-size:140px;float:left;margin:6px 0 0 0">'+ch+'</div>';
		} else {
			return  '<div style="font-size:140px;float:left;margin:6px 0 0 0">'+ch+'</div>';
		}
		
	}
}
function show_oracle(ch){	
	sss = sss +  find_char(ch);
}

 function jiaguwen(a){
	 if(tu3flag){
		 // 
		sss = '<div style="height:137px;margin:0;padding:0;">&nbsp;</div><div style="margin:0px;margin:0;padding:0;">' 
	} else {
		sss = " 转换的结果如下：  <hr/>"
	}	
	
	for(var i=0;i<a.length;i++){
		show_oracle(a.substring(i,i+1));
	}
}

function ke(a){
	var alen = a.length;
	if(alen<=3 && alen>0) {
		tu3flag = true;
	} else {
		tu3flag = false;
	}
	
	jiaguwen(a)
	
	if(!tu3flag){

		document.getElementById('div3').innerHTML=""
		document.getElementById('div3').style.display = "none"
		document.getElementById('div2').innerHTML=""
		document.getElementById('div2').style.display = ""

		//sss = sss +  "<HR  style='clear:both'><!--A target='_blank' HREF='cha.php?font="+encodeURIComponent(a)+"'>"+a+"</A-->"
		sss = sss +  "<div  style='clear:both'></div>"
		 
		sss = "【"+a+"】"+sss;;
		aNow = a;
		//document.getElementById('div2').innerHTML=document.getElementById('div2').innerHTML + "<HR  style='clear:both'><A HREF='jiaguwen.html?"+encodeURIComponent(a)+"'>"+a+"的甲骨文</A>"
		document.getElementById('div2').innerHTML= sss;
		document.getElementById('mingzi').value=a
	} else {

		document.getElementById('div2').innerHTML=""
		document.getElementById('div2').style.display = "none"
		document.getElementById('div3').innerHTML=""
		document.getElementById('div3').style.display = ""

		
		//sss = sss +  "<div style='clear:both'></div>"
		 
		//sss = "【<A target='_blank' HREF='cha.php?font="+encodeURIComponent(a)+"'>"+a+"</A>】"+sss;;
		//aNow = a;
		//document.getElementById('div2').innerHTML=document.getElementById('div2').innerHTML + "<HR  style='clear:both'><A HREF='jiaguwen.html?"+encodeURIComponent(a)+"'>"+a+"的甲骨文</A>"
		document.getElementById('div3').innerHTML= sss + "</div>";
		document.getElementById('mingzi').value=a
 	
	}
}

var passFlag = false;
var passNum = 4;
var passNow = 0;
function pass88(){
	passFlag = true;
	document.getElementById('verr123').innerHTML = "<span style='color:blue'>恭喜您获得无限制使用名字作画权限，赶快用好朋友的名字作画吧！</span> "
}

function dian2(){
	if(passFlag){
		ke(document.getElementById('mingzi').value)
	} else {
		passNow++;
		if(	passNow<passNum){
			
			ke(document.getElementById('mingzi').value);
			document.getElementById('verr123').innerHTML = "<span style='color:green'>除了给自己设计，也要给最爱的三个人免费设计下哦！可以用QQ截图/手机拍照发给他们，好好玩哦！</span> "
		} else {
			alert("点击图片上面分享按钮给好朋友，立马可以无限制使用哦！ "  )
			document.getElementById('verr123').innerHTML = "<span style='color:red'>点击下方分享按钮给好朋友，立马可以无限制使用哦！</span> "
		}
	}
}

function copyToClipBoard(){
    var clipBoardContent="";
      clipBoardContent+=this.location.href;
	  copyToClipboard("在微信疯狂传播的【震撼名字作画】\n" +clipBoardContent)
 
    alert("复制成功，请粘贴到你的QQ/MSN上推荐给你的好友");
}

function copyToClipboard(txt) {  
     if(window.clipboardData) {  
             window.clipboardData.clearData();  
             window.clipboardData.setData("Text", txt);  
     } else if(navigator.userAgent.indexOf("Opera") != -1) {  
          window.location = txt;  
     } else if (window.netscape) {  
          try {  
               netscape.security.PrivilegeManager.enablePrivilege("UniversalXPConnect");  
          } catch (e) {  
               alert("被浏览器拒绝！\n请在浏览器地址栏输入'about:config'并回车\n然后将 'signed.applets.codebase_principal_support'设置为'true'");  
          }  
          var clip = Components.classes['@mozilla.org/widget/clipboard;1'].createInstance(Components.interfaces.nsIClipboard);  
          if (!clip)  
               return;  
          var trans = Components.classes['@mozilla.org/widget/transferable;1'].createInstance(Components.interfaces.nsITransferable);  
          if (!trans)  
               return;  
          trans.addDataFlavor('text/unicode');  
          var str = new Object();  
          var len = new Object();  
          var str = Components.classes["@mozilla.org/supports-string;1"].createInstance(Components.interfaces.nsISupportsString);  
          var copytext = txt;  
          str.data = copytext;  
          trans.setTransferData("text/unicode",str,copytext.length*2);  
          var clipid = Components.interfaces.nsIClipboard;  
          if (!clip)  
               return false;  
          clip.setData(trans,null,clipid.kGlobalClipboard);  
     }  
 
} 